app/controllers/cities_controller.rb

  def create
    @city = City.new(params[:city])
    if @city.save
---
INSERT INTO "cities" ("name", "created_at", "latitude", "updated_at", "longitude") VALUES('Philadelphia', '2010-04-09 18:07:13', -39, '2010-04-09 18:07:13', 45)